app/controllers/home_controller.rb

SELECT `featured_users`.* FROM `featured_users` WHERE (start_date <= ('2013-02-04 09:28:29') and end_date >= ('2013-02-04 09:28:29'))
---
  def index
    @active_featured = FeaturedUser.where("start_date <= (?) and end_date >= (?)",Time.now,Time.now).map{|fu| fu.user_id}